# Dictionaries

In [1]:
dic = dict(name='Muhammad Awais', age=25, is_active=True, learning='yes')
dic

{'name': 'Muhammad Awais', 'age': 25, 'is_active': True, 'learning': 'yes'}

In [4]:
print(dic['name'])
print(dic.get('name'))

Muhammad Awais
Muhammad Awais

In [7]:
dic['age']=35
dic

{'name': 'Muhammad Awais',
 'age': 35,
 'is_active': True,
 'learning': 'yes',
 1: 25}

In [14]:
for j in dic.keys():
    print(j)

age
is_active
learning
1

In [13]:
for i in dic.values():
    print (i)

35
True
yes
25

In [16]:
for key, value in dic.items():
    print(f'{key}:{value}')

age:35
is_active:True
learning:yes
1:25

In [17]:
dic.items()

dict_items([('age', 35), ('is_active', True), ('learning', 'yes'), (1, 25)])

In [26]:
multi = {1:'geeks',2:'for',3:'geeks',4:{'a':'Welcome','b':'to','c':'gfg'}}
print(len(multi))
print(multi[4])
print(multi[4].keys())
# Updating
multi[4]['c']='geeksforgeeks'
print(multi)

4
{'a': 'Welcome', 'b': 'to', 'c': 'gfg'}
dict_keys(['a', 'b', 'c'])
{1: 'geeks', 2: 'for', 3: 'geeks', 4: {'a': 'Welcome', 'b': 'to', 'c': 'geeksforgeeks'}}

# Tuples

In [27]:
tup = (1,2,3,4,5,6,7,8)
a,b,*c = tup
print(a)
print(b)
print(c)

1
2
[3, 4, 5, 6, 7, 8]

In [62]:
for i in tup:
    print((i*2,))

(2,)
(4,)
(6,)
(8,)
(10,)
(12,)
(14,)
(16,)

# sets

In [39]:
st = {1,2,3,4,5}
st1 = set([5,6,7,8,9])
print(type(st))
st.add('Awais')
print(st)
print(st,st1)

<class 'set'>
{1, 2, 3, 4, 5, 'Awais'}
{1, 2, 3, 4, 5, 'Awais'} {5, 6, 7, 8, 9}

In [41]:
#normal set
st2 = set([1,2,2,3,3,4,5,6,1,7,8,2])
print(st2)

#Frozenset
st3 = frozenset([1,2,1,3,4,5,2])
print(st3)

{1, 2, 3, 4, 5, 6, 7, 8}
frozenset({1, 2, 3, 4, 5})

In [44]:
un = st.union(st1)
print(un)
# merge all the values except repeated values

inter = st.intersection(st1)
print(inter)
# only show the values present in both

popu = st|st1
print(popu)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 'Awais'}
{5}
{1, 2, 3, 4, 5, 6, 7, 8, 9, 'Awais'}

In [49]:
set1 = set()
set2 = set()

for i in range(1,6):
    set1.add(i)

for i in range(3,8):
    set2.add(i)

print(set1)
print(set2)

inters = set1&set2
print(inters)

diff1 = set1.difference(set2)
print(diff1)


diff2 = set2-set1
print(diff2)


# give all the values that are not present in the other set

{1, 2, 3, 4, 5}
{3, 4, 5, 6, 7}
{3, 4, 5}
{1, 2}
{6, 7}

In [51]:
set1.clear()
print(set1)

set()

In [2]:
print('geeksforgeeks'.split('ee'))

['g', 'ksforg', 'ks']

In [3]:
a,b=10,20
divmod(a,b)

(0, 10)

In [5]:
print(divmod(10.5,5))
print(divmod(2.4,1.2))

(2.0, 0.5)
(2.0, 0.0)

In [7]:
import pandas as pd

In [13]:
data1 = {
    'id':[1,2,3,4],
    'name':['awais','hamza','rizwan','usman'],
    'age':[24,23,31,35]
}
data2 = {
    'id':[1,2,3,5],
    'city':['ccw','sahiwal', 'saudia','saudia'],
    'occup':['Data Scientist','student', 'computer operator', 'employee']
}

In [14]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [15]:
df1

   id    name  age
0   1   awais   24
1   2   hamza   23
2   3  rizwan   31
3   4   usman   35

In [16]:
df2

   id     city              occup
0   1      ccw     Data Scientist
1   2  sahiwal            student
2   3   saudia  computer operator
3   5   saudia           employee

In [17]:
merge_df = pd.merge(df1, df2, on='id', how='inner')

In [12]:
merge_df

   id    name  age     city              occup
0   1   awais   24      ccw     Data Scientist
1   2   hamza   23  sahiwal            student
2   3  rizwan   31   saudia  computer operator
3   4   usman   35   saudia           employee

# SQL

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('example.db')

In [4]:
con_obj = conn.cursor()

In [5]:
table = '''create table if not exists user(id integer primary key, name varcher(20) not null, email varchar(30) unique not null, city varchar(20), ccode char(2));'''
con_obj.execute(table)

In [7]:
con_obj.execute('''insert into user values (1,'Muhammad Awais','awais100@gmail.com','Chichawatni', 'ccw')''')

In [10]:
con_obj.execute('''insert into user values (2, "Hamza", "hamza@gmail.com","Sahiwal", "sw"),(3, "Rizwan", "rizwan@gmail.com", "Lahore","lhr")''')

In [11]:
con_obj.execute("Select * from user")

In [12]:
print("Your all the data is inserted successfully")
output = con_obj.fetchall()
for i in output:
    print(i)

Your all the data is inserted successfully
(1, 'Muhammad Awais', 'awais100@gmail.com', 'Chichawatni', 'ccw')
(2, 'Hamza', 'hamza@gmail.com', 'Sahiwal', 'sw')
(3, 'Rizwan', 'rizwan@gmail.com', 'Lahore', 'lhr')

In [16]:
quary_update = '''update user set city ='Lahore' where city="Chichawatni"'''
con_obj.execute(quary_update)

show = con_obj.execute ("Select * from user")

output = con_obj.fetchmany(2)
for i in output:
    print(i)

(1, 'Muhammad Awais', 'awais100@gmail.com', 'Lahore', 'ccw')
(2, 'Hamza', 'hamza@gmail.com', 'Sahiwal', 'sw')

In [17]:
import pandas as pd

In [18]:
df = pd.read_sql_query('select * from user',conn)
df

   id            name               email     city ccode
0   1  Muhammad Awais  awais100@gmail.com   Lahore   ccw
1   2           Hamza     hamza@gmail.com  Sahiwal    sw
2   3          Rizwan    rizwan@gmail.com   Lahore   lhr

## Collection Objects

In [1]:
from collections import Counter

In [2]:
print(Counter(['a','b','a','c','d','d','d','c','e','f','a']))

Counter({'a': 3, 'd': 3, 'c': 2, 'b': 1, 'e': 1, 'f': 1})

## Comprihensions

### **List Comprehensions**

In [4]:
#1st Approch
even_list = [i for i in range(1,11) if i%2==0]
print(even_list)

#2nd Approch
even_list=[]
for i in range(1,11):
    if i%2==0:
        even_list.append(i)
print(even_list)

[2, 4, 6, 8, 10]
[2, 4, 6, 8, 10]

In [6]:
#1st Approch
odd_list = [i for i in range(1,11) if i%2!=0]
print(odd_list)

#2nd Approch
odd_list=[]
for i in range(1,11):
    if i %2!=0:
        odd_list.append(i)
print(odd_list)

[1, 3, 5, 7, 9]
[1, 3, 5, 7, 9]

In [8]:
number = int(input("Enter a number from 1 to 50: "))
less_num = [i for i in range(1,number)]
print(less_num)

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [12]:
l = [12,10,33,9,0,45,11,45,50,23,25,36,41]
def smaller_num(l, number):
    return [i for i in l if i<number]
smaller_num(l,45)

[12, 10, 33, 9, 0, 11, 23, 25, 36, 41]

In [13]:
even_list = [i for i in l if i%2==0]
print(even_list)
odd_list = [j for j in l if j%2!=0 ]
print(odd_list)

[12, 10, 0, 50, 36]
[33, 9, 45, 11, 45, 23, 25, 41]

In [16]:
s='geeksforgeeks'
ovel = [i for i in s if i in 'aeiou']
print(ovel)

['e', 'e', 'o', 'e', 'e']

In [17]:
s=['geeks','for','geeks','good','gold']
s_g = [i for i in s if i.startswith('g')]
print(s_g)

['geeks', 'geeks', 'good', 'gold']

In [19]:
[i.upper() for i in s if i.startswith('g')]

['GEEKS', 'GEEKS', 'GOOD', 'GOLD']

### Set Comprehension

In [20]:
l=[10,12,14,11,13,15,20,21,23,20]
s1 = {i for i in l if i%2==0}
s2 = {i for i in l if i%2!=0}
print(s1)
print(s2)

{10, 12, 20, 14}
{11, 13, 15, 21, 23}

### Dict Comprehension

In [21]:
dkt = {x:x**3 for x in l}
print(dkt)

{10: 1000, 12: 1728, 14: 2744, 11: 1331, 13: 2197, 15: 3375, 20: 8000, 21: 9261, 23: 12167}

In [23]:
l1=[101, 120, 130]
l2=['geeks', 'for', 'geeks']
d = {l1[i]:l2[i] for i in range(len(l1))}
print(d)

{101: 'geeks', 120: 'for', 130: 'geeks'}

In [25]:
d2 = {v:k for (k,v) in d.items()}
print(d2)

{'geeks': 130, 'for': 120}

In [6]:
num1 = 0.1
num2 = 0
num3 = 10
if num1>num2 and num1>num3:
    print(f"{num1} is greater")
elif num2>num1 and num2>num3:
    print(f"{num2} is greater")
else:
    print(f"{num3} is greater")

10 is greater

In [ ]:
l1 = [1,2,3,4,5,6,7]
sum = 0
for i in l1:
    sum=sum+i
print(sum)

l1 = [1,2,3,4,5,6,7]
sum = 0
for i in l1:
    sum=sum-i
print(sum)

28

In [7]:
number=123456
sum = 0
for i in str(number):
    print(int(sum+=i))
print(sum)

SyntaxError: invalid syntax (2736486717.py, line 4)